---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ToposolidType
source: html/178dfa01-21d3-ed61-f569-b1a5d1c353c9.htm
---
# ToposolidType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.